Revit 2027 API
MultiReferenceAnnotationType.IsAllowedReferenceCategory Method
 Checks if the reference category can be used with multi-reference annotations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAllowedReferenceCategory(
	ElementId referenceCategoryId
)
Public Function IsAllowedReferenceCategory (
	referenceCategoryId As ElementId
) As Boolean
public:
bool IsAllowedReferenceCategory(
	ElementId^ referenceCategoryId
)
member IsAllowedReferenceCategory :
        referenceCategoryId : ElementId -> bool
Parameters
referenceCategoryId ElementId
 The reference category to check.
Return Value
Boolean
 True when the reference category can be used by multi-reference annotations.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only Structural Rebar is allowed.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace